modm-ext/archive-stmicro-svd/rm_rm0410_stm32f765bgt6.svd
      <register>
        <name>BGCLUT.167</name>
        <addressOffset>0xa9c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.168</name>
        <addressOffset>0xaa0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.169</name>
        <addressOffset>0xaa4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.170</name>
        <addressOffset>0xaa8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.171</name>
        <addressOffset>0xaac</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.172</name>
        <addressOffset>0xab0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.173</name>
        <addressOffset>0xab4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.174</name>
        <addressOffset>0xab8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.175</name>
        <addressOffset>0xabc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.176</name>
        <addressOffset>0xac0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.177</name>
        <addressOffset>0xac4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.178</name>
        <addressOffset>0xac8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.179</name>
        <addressOffset>0xacc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.180</name>
        <addressOffset>0xad0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.181</name>
        <addressOffset>0xad4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.182</name>
        <addressOffset>0xad8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.183</name>
        <addressOffset>0xadc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.184</name>
        <addressOffset>0xae0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.185</name>
        <addressOffset>0xae4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.186</name>
        <addressOffset>0xae8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.187</name>
        <addressOffset>0xaec</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.188</name>
        <addressOffset>0xaf0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.189</name>
        <addressOffset>0xaf4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.190</name>
        <addressOffset>0xaf8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.191</name>
        <addressOffset>0xafc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.192</name>
        <addressOffset>0xb00</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.193</name>
        <addressOffset>0xb04</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.194</name>
        <addressOffset>0xb08</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.195</name>
        <addressOffset>0xb0c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.196</name>
        <addressOffset>0xb10</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.197</name>
        <addressOffset>0xb14</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.198</name>
        <addressOffset>0xb18</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.199</name>
        <addressOffset>0xb1c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.200</name>
        <addressOffset>0xb20</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.201</name>
        <addressOffset>0xb24</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.202</name>
        <addressOffset>0xb28</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.203</name>
        <addressOffset>0xb2c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.204</name>
        <addressOffset>0xb30</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.205</name>
        <addressOffset>0xb34</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.206</name>
        <addressOffset>0xb38</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.207</name>
        <addressOffset>0xb3c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.208</name>
        <addressOffset>0xb40</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.209</name>
        <addressOffset>0xb44</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.210</name>
        <addressOffset>0xb48</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.211</name>
        <addressOffset>0xb4c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.212</name>
        <addressOffset>0xb50</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.213</name>
        <addressOffset>0xb54</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.214</name>
        <addressOffset>0xb58</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.215</name>
        <addressOffset>0xb5c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.216</name>
        <addressOffset>0xb60</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.217</name>
        <addressOffset>0xb64</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.218</name>
        <addressOffset>0xb68</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.219</name>
        <addressOffset>0xb6c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.220</name>
        <addressOffset>0xb70</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.221</name>
        <addressOffset>0xb74</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.222</name>
        <addressOffset>0xb78</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.223</name>
        <addressOffset>0xb7c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.224</name>
        <addressOffset>0xb80</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.225</name>
        <addressOffset>0xb84</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.226</name>
        <addressOffset>0xb88</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.227</name>
        <addressOffset>0xb8c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.228</name>
        <addressOffset>0xb90</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.229</name>
        <addressOffset>0xb94</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.230</name>
        <addressOffset>0xb98</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.231</name>
        <addressOffset>0xb9c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.232</name>
        <addressOffset>0xba0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.233</name>
        <addressOffset>0xba4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.234</name>
        <addressOffset>0xba8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.235</name>
        <addressOffset>0xbac</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.236</name>
        <addressOffset>0xbb0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.237</name>
        <addressOffset>0xbb4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.238</name>
        <addressOffset>0xbb8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.239</name>
        <addressOffset>0xbbc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.240</name>
        <addressOffset>0xbc0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.241</name>
        <addressOffset>0xbc4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.242</name>
        <addressOffset>0xbc8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.243</name>
        <addressOffset>0xbcc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.244</name>
        <addressOffset>0xbd0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.245</name>
        <addressOffset>0xbd4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.246</name>
        <addressOffset>0xbd8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.247</name>
        <addressOffset>0xbdc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.248</name>
        <addressOffset>0xbe0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.249</name>
        <addressOffset>0xbe4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.250</name>
        <addressOffset>0xbe8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.251</name>
        <addressOffset>0xbec</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.252</name>
        <addressOffset>0xbf0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.253</name>
        <addressOffset>0xbf4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.254</name>
        <addressOffset>0xbf8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>BGCLUT.255</name>
        <addressOffset>0xbfc</addressOffset>
        <size>0x20</size>
      </register>
    </peripheral>
    <peripheral>
      <name>USB_OTG_HS</name>
      <baseAddress>0x40040000</baseAddress>
      <register>
        <name>GOTGCTL</name>
        <addressOffset>0x0</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>SRQSCS</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>SRQ</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>VBVALOEN</name>
          <bitOffset>2</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>VBVALOVA</name>
          <bitOffset>3</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>AVALOEN</name>
          <bitOffset>4</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>AVALOVAL</name>
          <bitOffset>5</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>BVALOEN</name>
          <bitOffset>6</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>BVALOVAL</name>
          <bitOffset>7</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>HNGSCS</name>
          <bitOffset>8</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>HNPRQ</name>
          <bitOffset>9</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>HSHNPEN</name>
          <bitOffset>10</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>DHNPEN</name>
          <bitOffset>11</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>EHEN</name>
          <bitOffset>12</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>s</name>
          <bitOffset>13</bitOffset>
          <bitWidth>19</bitWidth>
        </field>
        <field>
          <name>CIDSTS</name>
          <bitOffset>16</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>DBCT</name>
          <bitOffset>17</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ASVLD</name>
          <bitOffset>18</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>BSVLD</name>
          <bitOffset>19</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>OTGVER</name>
          <bitOffset>20</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CURMOD</name>
          <bitOffset>21</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>GOTGINT</name>
        <addressOffset>0x4</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>s</name>
          <bitOffset>0</bitOffset>
          <bitWidth>32</bitWidth>
        </field>
        <field>
          <name>SEDET</name>
          <bitOffset>2</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>SRSSCHG</name>
          <bitOffset>8</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>HNSSCHG</name>
          <bitOffset>9</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>HNGDET</name>
          <bitOffset>17</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ADTOCHG</name>
          <bitOffset>18</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>DBCDNE</name>
          <bitOffset>19</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>IDCHNG</name>
          <bitOffset>20</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>GAHBCFG</name>
        <addressOffset>0x8</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>GINTMSK</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>HBSTLEN</name>
          <bitOffset>1</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>DMAEN</name>
          <bitOffset>5</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>s</name>
          <bitOffset>6</bitOffset>
          <bitWidth>26</bitWidth>
        </field>
        <field>
          <name>TXFELVL</name>
          <bitOffset>7</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>PTXFELVL</name>
          <bitOffset>8</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>GUSBCFG</name>
        <addressOffset>0xc</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>TOCAL</name>
          <bitOffset>0</bitOffset>
          <bitWidth>3</bitWidth>
        </field>
        <field>
          <name>s</name>
          <bitOffset>3</bitOffset>
          <bitWidth>29</bitWidth>
        </field>
        <field>
          <name>PHYSEL</name>
          <bitOffset>6</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>SRPCAP</name>
          <bitOffset>8</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>HNPCAP</name>
          <bitOffset>9</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TRDT</name>
          <bitOffset>10</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>PHYLPC</name>
          <bitOffset>15</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ULPIFSL</name>
          <bitOffset>17</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ULPIAR</name>
          <bitOffset>18</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ULPICSM</name>
          <bitOffset>19</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ULPIEVBUSD</name>
          <bitOffset>20</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ULPIEVBUSI</name>
          <bitOffset>21</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TSDPS</name>
          <bitOffset>22</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>PCCI</name>
          <bitOffset>23</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>PTCI</name>
          <bitOffset>24</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ULPIIPD</name>
          <bitOffset>25</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>FHMOD</name>
          <bitOffset>29</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>FDMOD</name>
          <bitOffset>30</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>GRSTCTL</name>
        <addressOffset>0x10</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>CSRST</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>PSRST</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>s</name>
          <bitOffset>2</bitOffset>
          <bitWidth>28</bitWidth>
        </field>
        <field>
          <name>RXFFLSH</name>
          <bitOffset>4</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TXFFLSH</name>
          <bitOffset>5</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>TXFNUM</name>
          <bitOffset>6</bitOffset>
          <bitWidth>5</bitWidth>
        </field>
        <field>
          <name>DMAREQ</name>
          <bitOffset>30</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>AHBIDL</name>
          <bitOffset>31</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>GINTSTS</name>
        <addressOffset>0x14</addressOffset>
        <size>0x20</size>
      </register>
